from BrandrdXMusic import app 
import asyncio
import random
from pyrogram import Client, filters
from pyrogram.enums import ChatType, ChatMemberStatus
from pyrogram.errors import UserNotParticipant
from pyrogram.types import ChatPermissions

spam_chats = []

EMOJI = [ "🦋🦋🦋🦋🦋",
          "🧚🌸🧋🍬🫖",
          "🥀🌷🌹🌺💐",
          "🌸🌿💮🌱🌵",
          "❤️💚💙💜🖤",
          "💓💕💞💗💖",
          "🌸💐🌺🌹🦋",
          "🍔🦪🍛🍲🥗",
          "🍎🍓🍒🍑🌶️",
          "🧋🥤🧋🥛🍷",
          "🍬🍭🧁🎂🍡",
          "🍨🧉🍺☕🍻",
          "🥪🥧🍦🍥🍚",
          "🫖☕🍹🍷🥛",
          "☕🧃🍩🍦🍙",
          "🍁🌾💮🍂🌿",
          "🌨️🌥️⛈️🌩️🌧️",
          "🌷🏵️🌸🌺💐",
          "💮🌼🌻🍀🍁",
          "🧟🦸🦹🧙👸",
          "🧅🍠🥕🌽🥦",
          "🐷🐹🐭🐨🐻‍❄️",
          "🦋🐇🐀🐈🐈‍⬛",
          "🌼🌳🌲🌴🌵",
          "🥩🍋🍐🍈🍇",
          "🍴🍽️🔪🍶🥃",
          "🕌🏰🏩⛩️🏩",
          "🎉🎊🎈🎂🎀",
          "🪴🌵🌴🌳🌲",
          "🎄🎋🎍🎑🎎",
          "🦅🦜🕊️🦤🦢",
          "🦤🦩🦚🦃🦆",
          "🐬🦭🦈🐋🐳",
          "🐔🐟🐠🐡🦐",
          "🦩🦀🦑🐙🦪",
          "🐦🦂🕷️🕸️🐚",
          "🥪🍰🥧🍨🍨",
          " 🥬🍉🧁🧇",
        ]

TAGMES = [ " **➠ நல்ல இரவு, நண்பரே! நாளை உங்களுக்கு சிறப்பான நாளாக அமையட்டும். 🌚** ",
           " **➠ நான் எப்போதும் நம்பக்கூடிய உங்களைப் போன்ற ஒரு நண்பர் இருப்பது மிகவும் மகிழ்ச்சியாக இருக்கிறது. இரவு வணக்கம், நன்றாக தூங்குங்கள். 🙊** ",
           " **➠ தேவதூதர்கள் உங்களுக்காக அனைத்து இனிமையான கனவுகளையும் கொண்டு வரட்டும். நீங்கள் நீண்ட மற்றும் மகிழ்ச்சியான தூக்கத்தைப் பெறுவீர்கள். நல்ல இரவு, என் நண்பர்களே!..👻** ",
           " **➠ இன்றைய கனவுகள் நாளை நனவாகும். இந்த அமைதியான இரவில் நிம்மதியாக தூங்குங்கள்! குட் நைட், நண்பரே!.. 💫** ",
           " **➠ நான் கடவுளுக்கு மிகவும் நன்றியுள்ளவனாக இருக்கிறேன். ஏனென்றால் அவர் எனக்கு மிகவும் அற்புதமான நபரை நண்பராகக் கொடுத்தார், அது நீங்கள் தான், அன்பே! நல்ல இரவு! 🫂** ",
           " **➠ நாளை என்ன என்று யாருக்கும் தெரியாது. எனவே, கவலைப்படுவதை விட்டுவிட்டு கனவு காணத் தொடங்குங்கள். இனிய இரவு வணக்கம் நண்பர்களே! 💝** ",
           " **➠ நல்ல இரவு, அன்பே. நாளை உங்களுக்கு வாய்ப்புகள் நிறைந்த நாளாக இருக்கட்டும், இன்றிரவு இனிமையான கனவுகளுடன் நீங்கள் ஓய்வெடுக்கலாம். இறுக்கமாக தூங்கு!.. 🌠** ",
           " **➠ நல்ல இரவு.. 🙂** ",
           " **➠ நல்ல இரவு இனிமையான கனவுகள்.. ✨** ",
           " **➠ நல்ல இரவு, அன்பே. நாளை உங்களுக்கு வாய்ப்புகள் நிறைந்த நாளாக இருக்கட்டும், இன்றிரவு இனிமையான கனவுகளுடன் நீங்கள் ஓய்வெடுக்கலாம். இறுக்கமாக தூங்கு!.. 🌌** ",
           " **➠ எங்கள் நட்பு நிலவொளியை விட பிரகாசமானது. ஏனெனில் சந்திரன் இரவில் மட்டுமே தோன்றும். ஆனால் எங்கள் நட்பு 24 மணி நேரமும் இருக்கிறது. நல்ல இரவு நண்பா.. 💥** ",
           " **➠ உங்கள் கனவுகள் உங்கள் இலக்கை நோக்கி உங்களை வழிநடத்தட்டும், உங்கள் இதயத்தை அமைதி மற்றும் மகிழ்ச்சியுடன் நிரப்பவும். உங்கள் கவலைகள் மற்றும் சோகம் அனைத்தும் இரவின் இருளிலும் அமைதியிலும் சரணடையட்டும். நல்ல இரவு, நண்பரே. 🏫** ",
           " **➠ நீங்கள் சந்தேகத்திற்கு இடமின்றி எனது மிகப்பெரிய ஆதரவாளர்; இருக்கிறது, எப்போதும் இருக்கும்! உன்னை என் நண்பனாக அனுப்பிய கடவுளுக்கு என்னால் போதுமான நன்றி சொல்ல முடியாது. உங்களுக்கு நன்றியுடன் இருப்பதற்கு எனக்கு பல காரணங்கள் உள்ளன மற்றும் நீங்கள் ஒரு நாள் வெற்றியடைவீர்கள் என்று நம்புவதற்கு பல காரணங்கள் உள்ளன. நல்ல இரவு!..😊** ",
           " **➠ இனிய இரவு, என் அன்பு நண்பரே! உங்களுக்கு ஒரு அற்புதமான தூக்கம் இருக்கும் என்று நம்புகிறேன். விண்மீன்கள் நிறைந்த கனவுகளில் நீங்கள் துடைக்கப்படுவீர்கள். 🌼** ",
           " **➠ உங்களுக்கு ஒரு அற்புதமான இரவு இருப்பதை உறுதிசெய்ய அன்பையும் நேர்மறையான அதிர்வுகளையும் அனுப்புகிறது. இனிய இரவு வணக்கம்!! 🌷** ",
           " **➠ நன்றாக தூங்குங்கள், இனிமையான கனவுகளை காணுங்கள், என் அருமை நண்பரே. நீங்கள் ஒரு இனிமையான மற்றும் ஆறுதலான தூக்கத்தை அனுபவிப்பீர்கள் என்று நம்புகிறேன். உங்கள் கவலைகள் மறக்கப்படட்டும். 🏵️** ",
           " **➠ நாளை உங்களுக்கு மகிழ்ச்சி, மகிழ்ச்சி மற்றும் நீங்கள் விரும்பும் அனைத்தையும் கொண்டு வரட்டும். இப்போது உங்களுக்கு ஓய்வு கொடுங்கள், இதனால் நாளை உங்களின் சிறந்ததைக் கொடுக்க முடியும். நல்ல இரவு. 🍃** ",
           " **➠ நான் உங்களுக்கு ஒரு நல்ல இரவு வாழ்த்துகிறேன், பகல் முடிந்துவிட்டதால் அல்ல, மாறாக நாளை நிகழ்வுகள் நிறைந்ததாக இருக்கும் என்பதால். இறுதியாக, சவாலான நாளுக்குப் பிறகு ஒரு நல்ல இரவு தூக்கத்தை எதுவும் வெல்லாது. நல்ல இரவு, நண்பா!☃️** ",
           " **➠ எங்கள் அனைவரையும் விட நீங்கள் எப்போதும் வாழ்க்கையில் சிறந்து விளங்குகிறீர்கள். உங்கள் நீண்ட ஆயுளுக்காக நான் எப்போதும் பிரார்த்திக்கிறேன். நன்றாக தூங்குங்கள், இதனால் உங்களுக்கு ஒரு சிறந்த நாள் கிடைக்கும். நல்ல இரவு, நண்பா. ⛄** ",
           " **➠ உங்களைப் போன்ற ஒரு நண்பன் கிடைத்ததில் நான் அதிர்ஷ்டசாலி. மிகுந்த அன்புடன் இந்த செய்தியை அனுப்புகிறேன். இரவு வணக்கம் நண்பரே. இனிய கனவு காணுங்கள். 😁** ",
           " **➠ அமைதியான இரவு உங்கள் வாழ்க்கையில் ஒரு புதிய நாளுக்கான ஆற்றலின் ஆதாரமாக மாறட்டும்! உங்களுக்கு இறுக்கமான தூக்கம் மற்றும் நல்ல இரவு வாழ்த்துக்கள்! 🌄** ",
           " **➠ இரவு இருளாகவும் நீண்டதாகவும் இருக்கிறது. அனைத்து சோர்வையும் போக்கும் அமைதியான உறக்கத்தை நான் விரும்புகிறேன். இனிய இரவு அன்பே. இனிய கனவு காணுங்கள். 🤭** ",
           " **➠ நாம் உறங்கச் செல்வதற்கு முன் யாரேனும் ஒருவர் ஒரு நல்ல இரவை வாழ்த்துவது மிகவும் மகிழ்ச்சியாக இருக்கிறது. என்னைப் பொறுத்தவரை, இது இரட்டிப்பு மகிழ்ச்சி, ஏனென்றால் ஒருவர் எனது சிறந்த நண்பர். நல்ல இரவு!... 😊** ",
           " **➠ சில நேரங்களில் நான் முட்டாள்தனமாக இருக்கிறேன், ஆனால் நான் கவலைப்படுவதில்லை என்று நினைக்காதே. எதுவாக இருந்தாலும் உங்களுக்காக நான் எப்போதும் இருப்பேன். நல்ல இரவு.ᴇ ❤️** ",
           " **➠ நீங்கள் தனிமையாக உணர்ந்தால் கவலைப்பட வேண்டாம். எப்பொழுதும் உன்னை தொந்தரவு செய்ய நான் இங்கே இருக்கிறேன் 😛 இப்போது நன்றாக தூங்கு. இனிய இரவு அன்பே. ஒரு அற்புதமான பயங்கரமான கனவு! 💚** ",
           " **➠ நீங்கள் நன்றாக உறங்குவதற்கு அன்பான அரவணைப்புகளை அனுப்புகிறேன், நண்பரே! இனிமையான கனவுகள்! 🥱** ",
           " **➠ இந்த அழகான இரவில், நான் ஒரு அழகான நபருக்கு ஒரு அழகான செய்தியை அனுப்புகிறேன். குட்நைட் அன்பே சிறந்த நண்பரே. நன்றாக தூங்குங்கள். 💤** ",
           " **➠ வாழ்க்கையில் எக்காரணம் கொண்டும் வருத்தப்பட வேண்டிய அவசியம் இல்லை, ஏனென்றால் நான் எப்போதும் உங்கள் பின்னால் இருக்கிறேன். இனிய இரவு வணக்கம் நண்பரே! 🥰** ",
           " **➠ இரவு வணக்கம் நண்பரே. இன்றிரவு நீங்கள் காணும் கனவுகள் அனைத்தும் நீங்கள் எழுந்தவுடன் அழகான நிஜமாக மாற நான் பிரார்த்தனை செய்வேன்! 😜** ",
           " **➠ உங்களைப் போன்ற அருமையான நண்பர்களைக் கொண்டிருப்பது வாழ்க்கையை பயனுள்ளதாக்குகிறது. குட்நைட், என் அன்பான சிறந்த நண்பரே!... 💫** ",
           ]

VC_TAG = [ "**➠ காலை வணக்கம், எப்படி இருக்கிறீர்கள்? 🐱**",
         "**➠ GM, காலை ஆகிறது, எழுந்திருக்க வேண்டாமா? 🌤️**",
         "**➠ GM Baby, தேநீர் அருந்துங்கள் ☕**",
         "**➠ சீக்கிரம் எழுந்திரு, பள்ளிக்கூடம் போக வேண்டாமா? 🏫**",
         "**➠ GM, அமைதியாக படுக்கையை விட்டு எழுந்திரு அல்லது நான் தண்ணீர் தருகிறேன். 🧊**",
         "**➠ Baby, சீக்கிரம் எழுந்து பற்களை விளக்கு உணவு தயார். 🫕**",
         "**➠ இன்று ஆபிஸ் போக வேண்டாமா, இன்னும் எழுந்திருக்கவில்லையா? 🏣**",
         "**➠ GM நண்பர், ᴄᴏғғᴇᴇ/ᴛᴇᴀ நீங்கள் என்ன எடுப்பீர்கள் ☕🍵**",
         "**➠ Baby மணி 8 ஆகிவிட்டது, நீங்கள் இன்னும் எழுந்திருக்கவில்லை 🕖**",
         "**➠ கும்பகரனின் மகனே, எழுந்திரு!... ☃️**",
         "**➠ ɢᴏᴏᴅ ᴍᴏʀɴɪɴɢ ʜᴀᴠᴇ ᴀ ɴɪᴄᴇ ᴅᴀʏ... 🌄**",
         "**➠ ɢᴏᴏᴅ ᴍᴏʀɴɪɴɢ, ʜᴀᴠᴇ ᴀ ɢᴏᴏᴅ ᴅᴀʏ... 🪴**",
         "**➠ ɢᴏᴏᴅ ᴍᴏʀɴɪɴɢ, ʜᴏᴡ ᴀʀᴇ ʏᴏᴜ ʙᴀʙʏ 😇**",
         "**➠ ᴍᴜᴍᴍʏ இதோ, இந்த idiot இன்னும் தூங்கிக் கொண்டிருக்கிறார்.... 😵‍💫**",
         "**➠ நண்பரே, நீங்கள் இரவு முழுவதும் தூங்கிக்கொண்டிருந்தீர்களா, நீங்கள் இன்னும் தூங்குகிறீர்கள், நீங்கள் எழுந்திருக்க விரும்பவில்லை... 😏**",
         "**➠ நண்பரே, காலை வணக்கம் மற்றும் குழுவில் உள்ள அனைத்து நண்பர்களுக்கும் சோகத்தை வாழ்த்துகிறேன்... 🌟**",
         "**➠ அப்பா இன்னும் எழுந்திருக்கவில்லை, பள்ளி நேரம் நெருங்குகிறது.... 🥲**",
         "**➠ அன்பே, காலை வணக்கம், என்ன செய்கிறாய் ... 😅**",
         "**➠ ɢᴍ ʙᴇᴀsᴛɪᴇ, ʙʀᴇᴀᴋғᴀsᴛ என்ன நடந்தது... 🍳**",
        ]


@app.on_message(filters.command(["gntag", "tagmember" ], prefixes=["/", "@", "#"]))
async def mentionall(client, message):
    chat_id = message.chat.id
    if message.chat.type == ChatType.PRIVATE:
        return await message.reply("๏ ᴛʜɪs ᴄᴏᴍᴍᴀɴᴅ ᴏɴʟʏ ғᴏʀ ɢʀᴏᴜᴘs.")

    is_admin = False
    try:
        participant = await client.get_chat_member(chat_id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("๏ ʏᴏᴜ ᴀʀᴇ ɴᴏᴛ ᴀᴅᴍɪɴ ʙᴀʙʏ, ᴏɴʟʏ ᴀᴅᴍɪɴs ᴄᴀɴ ᴛᴀɢ ᴍᴇᴍʙᴇʀs. ")

    if message.reply_to_message and message.text:
        return await message.reply("/tagall ɢᴏᴏᴅ ᴍᴏʀɴɪɴɢ ᴛʏᴘᴇ ʟɪᴋᴇ ᴛʜɪs / ʀᴇᴘʟʏ ᴀɴʏ ᴍᴇssᴀɢᴇ ɴᴇxᴛ ᴛɪᴍᴇ ʙᴏᴛ ᴛᴀɢɢɪɴɢ...")
    elif message.text:
        mode = "text_on_cmd"
        msg = message.text
    elif message.reply_to_message:
        mode = "text_on_reply"
        msg = message.reply_to_message
        if not msg:
            return await message.reply("/tagall ɢᴏᴏᴅ ᴍᴏʀɴɪɴɢ ᴛʏᴘᴇ ʟɪᴋᴇ ᴛʜɪs / ʀᴇᴘʟʏ ᴀɴʏ ᴍᴇssᴀɢᴇ ɴᴇxᴛ ᴛɪᴍᴇ ғᴏᴛ ᴛᴀɢɢɪɴɢ...")
    else:
        return await message.reply("/tagall ɢᴏᴏᴅ ᴍᴏʀɴɪɴɢ ᴛʏᴘᴇ ʟɪᴋᴇ ᴛʜɪs / ʀᴇᴘʟʏ ᴀɴʏ ᴍᴇssᴀɢᴇ ɴᴇxᴛ ᴛɪᴍᴇ ʙᴏᴛ ᴛᴀɢɢɪɴɢ...")
    if chat_id in spam_chats:
        return await message.reply("๏ ᴘʟᴇᴀsᴇ ᴀᴛ ғɪʀsᴛ sᴛᴏᴘ ʀᴜɴɴɪɴɢ ᴍᴇɴᴛɪᴏɴ ᴘʀᴏᴄᴇss...")
    spam_chats.append(chat_id)
    usrnum = 0
    usrtxt = ""
    async for usr in client.get_chat_members(chat_id):
        if not chat_id in spam_chats:
            break
        if usr.user.is_bot:
            continue
        usrnum += 1
        usrtxt += "<a href='tg://user?id={}'>{}</a>".format(usr.user.id, usr.user.first_name)

        if usrnum == 1:
            if mode == "text_on_cmd":
                txt = f"{usrtxt} {random.choice(TAGMES)}"
                await client.send_message(chat_id, txt)
            elif mode == "text_on_reply":
                await msg.reply(f"[{random.choice(EMOJI)}](tg://user?id={usr.user.id})")
            await asyncio.sleep(4)
            usrnum = 0
            usrtxt = ""
    try:
        spam_chats.remove(chat_id)
    except:
        pass


@app.on_message(filters.command(["gmtag"], prefixes=["/", "@", "#"]))
async def mention_allvc(client, message):
    chat_id = message.chat.id
    if message.chat.type == ChatType.PRIVATE:
        return await message.reply("๏ ᴛʜɪs ᴄᴏᴍᴍᴀɴᴅ ᴏɴʟʏ ғᴏʀ ɢʀᴏᴜᴘs.")

    is_admin = False
    try:
        participant = await client.get_chat_member(chat_id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("๏ ʏᴏᴜ ᴀʀᴇ ɴᴏᴛ ᴀᴅᴍɪɴ ʙᴀʙʏ, ᴏɴʟʏ ᴀᴅᴍɪɴs ᴄᴀɴ ᴛᴀɢ ᴍᴇᴍʙᴇʀs. ")
    if chat_id in spam_chats:
        return await message.reply("๏ ᴘʟᴇᴀsᴇ ᴀᴛ ғɪʀsᴛ sᴛᴏᴘ ʀᴜɴɴɪɴɢ ᴍᴇɴᴛɪᴏɴ ᴘʀᴏᴄᴇss...")
    spam_chats.append(chat_id)
    usrnum = 0
    usrtxt = ""
    async for usr in client.get_chat_members(chat_id):
        if not chat_id in spam_chats:
            break
        if usr.user.is_bot:
            continue
        usrnum += 1
        usrtxt += "<a href='tg://user?id={}'>{}</a>".format(usr.user.id, usr.user.first_name)

        if usrnum == 1:
            txt = f"{usrtxt} {random.choice(VC_TAG)}"
            await client.send_message(chat_id, txt)
            await asyncio.sleep(4)
            usrnum = 0
            usrtxt = ""
    try:
        spam_chats.remove(chat_id)
    except:
        pass



@app.on_message(filters.command(["gmstop", "gnstop", "cancle"]))
async def cancel_spam(client, message):
    if not message.chat.id in spam_chats:
        return await message.reply("๏ ᴄᴜʀʀᴇɴᴛʟʏ ɪ'ᴍ ɴᴏᴛ ᴛᴀɢɢɪɴɢ ʙᴀʙʏ.")
    is_admin = False
    try:
        participant = await client.get_chat_member(message.chat.id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("๏ ʏᴏᴜ ᴀʀᴇ ɴᴏᴛ ᴀᴅᴍɪɴ ʙᴀʙʏ, ᴏɴʟʏ ᴀᴅᴍɪɴs ᴄᴀɴ ᴛᴀɢ ᴍᴇᴍʙᴇʀs.")
    else:
        try:
            spam_chats.remove(message.chat.id)
        except:
            pass
        return await message.reply("๏ ᴍᴇɴᴛɪᴏɴ ᴘʀᴏᴄᴇss sᴛᴏᴘᴘᴇᴅ ๏")
              
